{
    "0": {"character": "UX", "content": "Unlike software testing, which seeks to identify code errors, usability testing aims to see if the solution really resolves and understand the problems faced by the users.", "next": "1"},
    "1": {"character": "UX", "content": "So when we show the prototype to the user and observe their behaviour, while asking the right questions, we can know if the product is enjoyable to use or not.", "next": "2"},
    "2": {"character": "UX", "content": "We also need to listen to the user's feedback to obtain more insights and verify our solutions. In this stage, we can find opportunities to improve their user experience as well!", "next": "3"},
    "3": {"character": "UX", "content": "Let's roleplay! I will pretend to be the user. \n*wears chicken mask* \nBased on the product, ask me a question.",
         "options": [
        {"text": "Can you briefly tell me about yourself?", "next": "4"},
        {"text": "On a scale of 1-5, how confident are you with using a mobile device?", "next": "4"}
        ]},
    "4": {"character": "UX", "content": "That's a good question to start with! This way, we can gauge the user's demographic, which is important.", "next": "5"},
    "5": {"character": "UX", "content": "Ask another one!",
         "options": [
         {"text": "How would you describe your overall experience with the product?", "next": "6"},
         {"text": "Is this feature relevant?", "next": "7"},
         {"text": "Do you like the product?", "next": "9"}   
         ]},
    "6": {"character": "UX", "content": "That's a great question! As mentioned before, open-ended questions are the best as it provides the opportunity for the user to explain themselves.", "next": "14"},
    "7": {"character": "UX", "content": "That's not a good question because it is a leading question. Leading questions are questions that are asked with the intend to receive a desired answer, which will influence the user's answers.", "next": "8"},
    "8": {"character": "UX", "content": "Avoid leading questions as much as possible, let's try another one!", 
        "options": [
        {"text": "How can we make the product better?", "next": "10"},
        {"text": "What, if anything, causes you frustration?", "next": "13"}
        ]},
    "9": {"character": "UX", "content": "I can answer that for you, they will say yes! Because they are nice people who don't want to crush your work. This question isn't good as it adds social pressure to give a positive answer.", "next": "10"},
    "10": {"character": "UX", "content": "However, we want their honest answer, which is not necessarily positive! Let's try another one:",
        "options": [
        {"text": "How can we make the product better?", "next": "11"},
        {"text": "What, if anything, causes you frustration?", "next": "13"}
        ]},
    "11": {"character": "UX", "content": "That's not an ideal question. The purpose of usability testing is not to ask the users for design ideas, that's our job!", "next": "12"},
    "12": {"character": "UX", "content": "The aim of usability testing is to get the users to talk about their experience honestly.", "next": "14"},
    "13": {"character": "UX", "content": "That's a great question! As mentioned before, open-ended questions are the best as it provides the opportunity for the user to explain themselves.", "next": "14"},
    "14": {"character": "UX", "content": "Another benefit of usability testing is that it will reduce the chances of reworks in the later stages, hence, reducing development costs!", "next": "15"},
    "15": {"character": "Product Owner", "content": "Thank you for the information! I've learnt a lot during this session"}
       
    }